---
kind: enumMember
id: F:Autodesk.Revit.DB.Architecture.BreakPatternCondition.EachSegmentEnd
enum: Autodesk.Revit.DB.Architecture.BreakPatternCondition
source: html/f1d994b6-e7a1-3932-331d-3c0e83bc002d.htm
---
# Autodesk.Revit.DB.Architecture.BreakPatternCondition.EachSegmentEnd

Patterns distribution is broken at each segment end.